Output from `terraform plan`
```
                  - {
                      - Action   = [
                          - "kinesis:SubscribeToShard",
                          - "kinesis:ListShards",
                          - "kinesis:GetShardIterator",
                          - "kinesis:GetRecords",
                          - "kinesis:DescribeStream",
                          - "kinesis:DescribeLimits",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:kinesis:eu-west-2:972272129531:stream/dpr-*"
                    },
                  - {
                      - Action   = [
                          - "secretsmanager:GetSecretValue",
                          - "secretsmanager:DescribeSecret",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:secretsmanager:eu-west-2:972272129531:secret:dpr-redshift-secret-*"
                    },
                  - {
                      - Action   = [
                          - "kms:ReEncrypt*",
                          - "kms:GenerateDataKey*",
                          - "kms:Encrypt*",
                          - "kms:DescribeKey",
                          - "kms:Decrypt*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:kms:*:972272129531:key/*"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:Update*",
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:PutItem",
                          - "dynamodb:Get*",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:DescribeStream",
                          - "dynamodb:Delete*",
                          - "dynamodb:CreateTable",
                          - "dynamodb:BatchWrite*",
                          - "dynamodb:BatchGet*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:eu-west-2:972272129531:table/dpr-*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (6 unchanged attributes hidden)
    }

  # module.ingestion-pipeline["dps-case-notes"].module.data_ingestion_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = (known after apply)
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-ingestion-pipeline-dps-dps-case-notes-preproduction"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = "arn:aws:iam::972272129531:role/dpr-step-function-execution-role"
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "dps-case-notes"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "dps-case-notes"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)
    }

  # module.lambda-setup.module.step_function_notification_lambda.data.aws_iam_policy_document.lambda_assume_role will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda_assume_role" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + effect  = "Allow"

          + principals {
              + identifiers = [
                  + "lambda.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.lambda-setup.module.step_function_notification_lambda.data.aws_iam_policy_document.lambda_execution will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda_execution" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + resources = [
              + "arn:aws:logs:eu-west-2:*:*",
            ]
        }
      + statement {
          + actions   = [
              + "xray:PutTelemetryRecords",
              + "xray:PutTraceSegments",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "cloudwatch:PutMetricData",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:AttachNetworkInterface",
              + "ec2:CreateNetworkInterface",
              + "ec2:DeleteNetworkInterface",
              + "ec2:DescribeInstances",
              + "ec2:DescribeNetworkInterfaces",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "cloudwatch:PutMetricData",
            ]
          + resources = [
              + "*",
            ]
        }
    }

  # module.lambda-setup.module.step_function_notification_lambda.aws_iam_policy.lambda_execution[0] will be updated in-place
  ~ resource "aws_iam_policy" "lambda_execution" {
        id               = "arn:aws:iam::972272129531:policy/dpr-pipeline-notification-policy"
        name             = "dpr-pipeline-notification-policy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:eu-west-2:*:*"
                    },
                  - {
                      - Action   = [
                          - "xray:PutTraceSegments",
                          - "xray:PutTelemetryRecords",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "cloudwatch:PutMetricData"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "ec2:DescribeNetworkInterfaces",
                          - "ec2:DescribeInstances",
                          - "ec2:DeleteNetworkInterface",
                          - "ec2:CreateNetworkInterface",
                          - "ec2:AttachNetworkInterface",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "cloudwatch:PutMetricData"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (5 unchanged attributes hidden)
    }

  # module.lambda-setup.module.step_function_notification_lambda.aws_iam_role.this[0] will be updated in-place
  ~ resource "aws_iam_role" "this" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "dpr-pipeline-notification-role"
        name                  = "dpr-pipeline-notification-role"
        tags                  = {}
        # (8 unchanged attributes hidden)
    }

  # module.maintenance-pipeline["dps-case-notes"].module.maintenance_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = (known after apply)
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-maintenance-pipeline-dps-dps-case-notes-preproduction"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = "arn:aws:iam::972272129531:role/dpr-step-function-execution-role"
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "dps-case-notes"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "dps-case-notes"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)
    }

  # module.reconciliation-jobs["dps-case-notes"].module.glue_s3_data_reconciliation_job.aws_cloudwatch_log_group.continuous_log[0] will be created
  + resource "aws_cloudwatch_log_group" "continuous_log" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws-glue/jobs/dpr-reconciliation-dps-case-notes-preproduction-dpr-reconciliation-dps-case-notes-sec-config"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Domain"         = "dps-case-notes"
          + "Jira"           = "DPR2-1117"
          + "Name"           = "dpr-data-reconciliation-preproduction"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
      + tags_all          = {
          + "Domain"         = "dps-case-notes"
          + "Jira"           = "DPR2-1117"
          + "Name"           = "dpr-data-reconciliation-preproduction"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
    }

  # module.reconciliation-jobs["dps-case-notes"].module.glue_s3_data_reconciliation_job.aws_cloudwatch_log_group.job[0] will be created
  + resource "aws_cloudwatch_log_group" "job" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws-glue/jobs/dpr-reconciliation-dps-case-notes-preproduction"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Domain"         = "dps-case-notes"
          + "Jira"           = "DPR2-1117"
          + "Name"           = "dpr-data-reconciliation-preproduction"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
      + tags_all          = {
          + "Domain"         = "dps-case-notes"
          + "Jira"           = "DPR2-1117"
          + "Name"           = "dpr-data-reconciliation-preproduction"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
    }

  # module.reconciliation-jobs["dps-case-notes"].module.glue_s3_data_reconciliation_job.aws_cloudwatch_log_group.sec_config[0] will be created
  + resource "aws_cloudwatch_log_group" "sec_config" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws-glue/jobs/dpr-reconciliation-dps-case-notes-sec-config"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Domain"         = "dps-case-notes"
          + "Jira"           = "DPR2-1117"
          + "Name"           = "dpr-data-reconciliation-preproduction"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
      + tags_all          = {
          + "Domain"         = "dps-case-notes"
          + "Jira"           = "DPR2-1117"
          + "Name"           = "dpr-data-reconciliation-preproduction"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
    }

  # module.reconciliation-jobs["dps-case-notes"].module.glue_s3_data_reconciliation_job.aws_cloudwatch_log_group.sec_config_error[0] will be created
  + resource "aws_cloudwatch_log_group" "sec_config_error" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws-glue/jobs/dpr-reconciliation-dps-case-notes-sec-config-role/dpr-reconciliation-dps-case-notes-preproduction-glue-role/error"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Domain"         = "dps-case-notes"
          + "Jira"           = "DPR2-1117"
          + "Name"           = "dpr-data-reconciliation-preproduction"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
      + tags_all          = {
          + "Domain"         = "dps-case-notes"
          + "Jira"           = "DPR2-1117"
          + "Name"           = "dpr-data-reconciliation-preproduction"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
    }

  # module.reconciliation-jobs["dps-case-notes"].module.glue_s3_data_reconciliation_job.aws_cloudwatch_log_group.sec_config_output[0] will be created
  + resource "aws_cloudwatch_log_group" "sec_config_output" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws-glue/jobs/dpr-reconciliation-dps-case-notes-sec-config-role/dpr-reconciliation-dps-case-notes-preproduction-glue-role/output"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Domain"         = "dps-case-notes"
          + "Jira"           = "DPR2-1117"
          + "Name"           = "dpr-data-reconciliation-preproduction"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
      + tags_all          = {
          + "Domain"         = "dps-case-notes"
          + "Jira"           = "DPR2-1117"
          + "Name"           = "dpr-data-reconciliation-preproduction"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
    }

  # module.reconciliation-jobs["dps-case-notes"].module.glue_s3_data_reconciliation_job.aws_glue_job.glue_job[0] will be created
  + resource "aws_glue_job" "glue_job" {
      + arn                    = (known after apply)
      + connections            = [
          + "dpr-operational-datastore-connection",
          + "dpr-dps-case-notes-connection",
        ]
      + default_arguments      = {
          + "--TempDir"                                                   = "s3://dpr-glue-jobs-preproduction/tmp/dpr-reconciliation-dps-case-notes-preproduction/"
          + "--class"                                                     = "uk.gov.justice.digital.job.DataReconciliationJob"
          + "--continuous-log-logGroup"                                   = "/aws-glue/jobs/dpr-reconciliation-dps-case-notes-preproduction"
          + "--dpr.aws.region"                                            = "eu-west-2"
          + "--dpr.config.key"                                            = "dps-case-notes"
          + "--dpr.config.s3.bucket"                                      = "dpr-glue-jobs-preproduction"
          + "--dpr.contract.registryName"                                 = "dpr-schema-registry-preproduction"
          + "--dpr.curated.s3.path"                                       = "s3://dpr-curated-zone-preproduction/"
          + "--dpr.dms.replication.task.id"                               = "dpr-dms-dps-postgres-s3-dps-case-notes-task-preproduction"
          + "--dpr.log.level"                                             = "INFO"
          + "--dpr.operational.data.store.glue.connection.name"           = "dpr-operational-datastore-connection"
          + "--dpr.operational.data.store.jdbc.batch.size"                = "5000"
          + "--dpr.operational.data.store.loading.schema.name"            = "loading"
          + "--dpr.operational.data.store.tables.to.write.table.name"     = "configuration.datahub_managed_tables"
          + "--dpr.operational.data.store.write.enabled"                  = "true"
          + "--dpr.raw.archive.s3.path"                                   = "s3://dpr-raw-archive-preproduction/"
          + "--dpr.raw.s3.path"                                           = "s3://dpr-raw-zone-preproduction/"
          + "--dpr.reconciliation.checks.to.run"                          = "current_state_counts,change_data_counts"
          + "--dpr.reconciliation.cloudwatch.metrics.namespace"           = "DPRDataReconciliationCustom"
          + "--dpr.reconciliation.datasource.glue.connection.name"        = "dpr-dps-case-notes-connection"
          + "--dpr.reconciliation.datasource.should.uppercase.tablenames" = "false"
          + "--dpr.reconciliation.datasource.source.schema.name"          = "public"
          + "--dpr.reconciliation.fail.job.if.checks.fail"                = "false"
          + "--dpr.reconciliation.report.results.to.cloudwatch"           = "true"
          + "--dpr.structured.s3.path"                                    = "s3://dpr-structured-zone-preproduction/"
          + "--enable-continuous-cloudwatch-log"                          = "false"
          + "--enable-continuous-log-filter"                              = "false"
          + "--enable-glue-datacatalog"                                   = "true"
          + "--enable-job-insights"                                       = "true"
          + "--enable-spark-ui"                                           = "true"
          + "--extra-files"                                               = "s3://dpr-glue-jobs-preproduction/logging/ingestion-jobs/log4j2.properties"
          + "--extra-jars"                                                = "s3://dpr-artifact-store-preproduction/build-artifacts/digital-prison-reporting-jobs/jars/digital-prison-reporting-jobs-vLatest-all.jar"
          + "--job-bookmark-option"                                       = "job-bookmark-disable"
          + "--job-language"                                              = "scala"
          + "--spark-event-logs-path"                                     = "s3://dpr-glue-jobs-preproduction/spark-logs/dpr-reconciliation-dps-case-notes-preproduction/"
        }
      + description            = <<-EOT
            Reconciles data across DataHub.
            Arguments:
            --dpr.config.key: (Required) config key e.g. prisoner
            --dpr.dms.replication.task.id: (Required) ID of the DMS replication task to reconcile against the raw zone
            --dpr.reconciliation.checks.to.run: (Optional) Allows restricting the set of checks that will be run
        EOT
      + execution_class        = "STANDARD"
      + glue_version           = "4.0"
      + id                     = (known after apply)
      + max_capacity           = (known after apply)
      + max_retries            = 0
      + name                   = "dpr-reconciliation-dps-case-notes-preproduction"
      + number_of_workers      = 2
      + role_arn               = (known after apply)
      + security_configuration = (known after apply)
      + tags                   = {
          + "Dept"           = "Digital-Prison-Reporting"
          + "Domain"         = "dps-case-notes"
          + "Jira"           = "DPR2-1117"
          + "Name"           = "dpr-data-reconciliation-preproduction"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
      + tags_all               = {
          + "Dept"           = "Digital-Prison-Reporting"
          + "Domain"         = "dps-case-notes"
          + "Jira"           = "DPR2-1117"
          + "Name"           = "dpr-data-reconciliation-preproduction"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
      + timeout                = (known after apply)
      + worker_type            = "G.1X"

      + command {
          + name            = "glueetl"
          + python_version  = (known after apply)
          + runtime         = (known after apply)
          + script_location = "s3://dpr-artifact-store-preproduction/build-artifacts/digital-prison-reporting-jobs/scripts/digital-prison-reporting-jobs-vLatest.scala"
        }

      + execution_property {
          + max_concurrent_runs = 1
        }
    }

  # module.reconciliation-jobs["dps-case-notes"].module.glue_s3_data_reconciliation_job.aws_glue_security_configuration.sec_cfg[0] will be created
  + resource "aws_glue_security_configuration" "sec_cfg" {
      + id   = (known after apply)
      + name = "dpr-reconciliation-dps-case-notes-sec-config"

      + encryption_configuration {
          + cloudwatch_encryption {
              + cloudwatch_encryption_mode = "DISABLED"
            }
          + job_bookmarks_encryption {
              + job_bookmarks_encryption_mode = "DISABLED"
            }
          + s3_encryption {
              + kms_key_arn        = "arn:aws:kms:eu-west-2:972272129531:key/7f78035f-f870-41b2-b00b-b7398cd6eb2d"
              + s3_encryption_mode = "SSE-KMS"
            }
        }
    }

  # module.reconciliation-jobs["dps-case-notes"].module.glue_s3_data_reconciliation_job.aws_iam_policy.additional-policy[0] will be created
  + resource "aws_iam_policy" "additional-policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Extra Policy for AWS Glue Job"
      + id               = (known after apply)
      + name             = "dpr-reconciliation-dps-case-notes-preproduction-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:*"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::dpr-*/*",
                          + "arn:aws:s3:::dpr-*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                          + "logs:AssociateKmsKey",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:/aws-glue/*"
                    },
                  + {
                      + Action   = [
                          + "sqs:*",
                          + "iam:ListRolePolicies",
                          + "iam:GetRolePolicy",
                          + "iam:GetRole",
                          + "glue:*",
                          + "cloudwatch:PutMetricData",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "dms:StopReplicationTask",
                          + "dms:DescribeTableStatistics",
                          + "dms:DescribeReplicationTasks",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dms:eu-west-2:972272129531:*:*"
                    },
                  + {
                      + Action   = [
                          + "kinesis:SubscribeToShard",
                          + "kinesis:ListShards",
                          + "kinesis:GetShardIterator",
                          + "kinesis:GetRecords",
                          + "kinesis:DescribeStream",
                          + "kinesis:DescribeLimits",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:kinesis:eu-west-2:972272129531:stream/dpr-*"
                    },
                  + {
                      + Action   = [
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:DescribeSecret",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:secretsmanager:eu-west-2:972272129531:secret:external/dpr-dps-case-notes-source-secrets-GtLOZk",
                          + "arn:aws:secretsmanager:eu-west-2:972272129531:secret:dpr-redshift-secret-*",
                          + "arn:aws:secretsmanager:eu-west-2:972272129531:secret:dpr-rds-operational-db-secret-SLvlRb",
                        ]
                    },
                  + {
                      + Action   = [
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Encrypt*",
                          + "kms:DescribeKey",
                          + "kms:Decrypt*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:kms:*:972272129531:key/*"
                    },
                  + {
                      + Action   = [
                          + "dynamodb:Update*",
                          + "dynamodb:Scan",
                          + "dynamodb:Query",
                          + "dynamodb:PutItem",
                          + "dynamodb:Get*",
                          + "dynamodb:DescribeTable",
                          + "dynamodb:DescribeStream",
                          + "dynamodb:Delete*",
                          + "dynamodb:CreateTable",
                          + "dynamodb:BatchWrite*",
                          + "dynamodb:BatchGet*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:eu-west-2:972272129531:table/dpr-*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.reconciliation-jobs["dps-case-notes"].module.glue_s3_data_reconciliation_job.aws_iam_role.glue-service-role[0] will be created
  + resource "aws_iam_role" "glue-service-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "glue.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-reconciliation-dps-case-notes-preproduction-glue-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Dept"           = "Digital-Prison-Reporting"
          + "Domain"         = "dps-case-notes"
          + "Jira"           = "DPR2-1117"
          + "Name"           = "dpr-data-reconciliation-preproduction"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
      + tags_all              = {
          + "Dept"           = "Digital-Prison-Reporting"
          + "Domain"         = "dps-case-notes"
          + "Jira"           = "DPR2-1117"
          + "Name"           = "dpr-data-reconciliation-preproduction"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.reconciliation-jobs["dps-case-notes"].module.glue_s3_data_reconciliation_job.aws_iam_role_policy_attachment.glue_policies["arn:aws:iam::972272129531:policy/dpr-reconciliation-dps-case-notes-preproduction-policy"] will be created
  + resource "aws_iam_role_policy_attachment" "glue_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr-reconciliation-dps-case-notes-preproduction-policy"
      + role       = "dpr-reconciliation-dps-case-notes-preproduction-glue-role"
    }

  # module.reconciliation-jobs["dps-case-notes"].module.glue_s3_data_reconciliation_job.aws_iam_role_policy_attachment.glue_policies["arn:aws:iam::aws:policy/service-role/AWSGlueServiceRole"] will be created
  + resource "aws_iam_role_policy_attachment" "glue_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSGlueServiceRole"
      + role       = "dpr-reconciliation-dps-case-notes-preproduction-glue-role"
    }

  # module.reload-pipeline["dps-case-notes"].module.reload_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = (known after apply)
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-reload-pipeline-dps-dps-case-notes-preproduction"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = "arn:aws:iam::972272129531:role/dpr-step-function-execution-role"
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "dps-case-notes"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "dps-case-notes"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)
    }

  # module.replay-pipeline["dps-case-notes"].module.replay_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = (known after apply)
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-replay-pipeline-dps-dps-case-notes-preproduction"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = "arn:aws:iam::972272129531:role/dpr-step-function-execution-role"
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "dps-case-notes"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "dps-case-notes"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)
    }

  # module.setup-dms-endpoints["dps-activities"].module.dms_endpoints.aws_dms_endpoint.dms-s3-target-source[0] will be updated in-place
  ~ resource "aws_dms_endpoint" "dms-s3-target-source" {
        id            = "dpr-dms-dps-activities-pgres-source-endpoint"
        tags          = {
            "DMS_Source"     = "dps"
            "Domain"         = "Common"
            "Jira"           = "main"
            "Resource_Type"  = "DMS Source Endpoint"
            "Service_Bundle" = "true"
        }
        # (12 unchanged attributes hidden)

      ~ postgres_settings {
          ~ fail_tasks_on_lob_truncation = false -> true
          ~ heartbeat_frequency          = 0 -> 5
            # (6 unchanged attributes hidden)
        }
    }

  # module.setup-dms-endpoints["dps-case-notes"].module.dms_endpoints.aws_dms_endpoint.dms-s3-target-source[0] will be created
  + resource "aws_dms_endpoint" "dms-s3-target-source" {
      + certificate_arn             = (known after apply)
      + database_name               = (sensitive value)
      + endpoint_arn                = (known after apply)
      + endpoint_id                 = "dpr-dms-dps-case-notes-pgres-source-endpoint"
      + endpoint_type               = "source"
      + engine_name                 = "postgres"
      + extra_connection_attributes = "PluginName=test_decoding"
      + id                          = (known after apply)
      + kms_key_arn                 = (known after apply)
      + password                    = (sensitive value)
      + port                        = 5432
      + server_name                 = (sensitive value)
      + ssl_mode                    = "require"
      + tags                        = {
          + "DMS_Source"     = "dps"
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Source Endpoint"
          + "Service_Bundle" = "true"
        }
      + tags_all                    = {
          + "DMS_Source"     = "dps"
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Source Endpoint"
          + "Service_Bundle" = "true"
        }
      + username                    = (sensitive value)

      + postgres_settings {
          + fail_tasks_on_lob_truncation = true
          + heartbeat_enable             = true
          + heartbeat_frequency          = 5
          + map_boolean_as_boolean       = true
        }
    }

  # module.setup-dms-endpoints["dps-case-notes"].module.dms_endpoints.aws_dms_s3_endpoint.dms-s3-target-endpoint[0] will be created
  + resource "aws_dms_s3_endpoint" "dms-s3-target-endpoint" {
      + add_column_name                             = false
      + bucket_name                                 = "dpr-raw-zone-preproduction"
      + cdc_inserts_and_updates                     = true
      + cdc_inserts_only                            = false
      + cdc_max_batch_interval                      = 10
      + cdc_path                                    = "cdc"
      + certificate_arn                             = (known after apply)
      + compression_type                            = "NONE"
      + csv_delimiter                               = ","
      + csv_row_delimiter                           = "\\n"
      + data_format                                 = "parquet"
      + date_partition_enabled                      = false
      + enable_statistics                           = true
      + endpoint_arn                                = (known after apply)
      + endpoint_id                                 = "dpr-dms-dps-case-notes-s3-target-endpoint"
      + endpoint_type                               = "target"
      + engine_display_name                         = (known after apply)
      + external_id                                 = (known after apply)
      + glue_catalog_generation                     = false
      + id                                          = (known after apply)
      + include_op_for_full_load                    = true
      + kms_key_arn                                 = (known after apply)
      + max_file_size                               = 120000
      + parquet_timestamp_in_millisecond            = false
      + preserve_transactions                       = false
      + rfc_4180                                    = true
      + service_access_role_arn                     = (known after apply)
      + ssl_mode                                    = (known after apply)
      + status                                      = (known after apply)
      + tags                                        = {
          + "DMS_Source"     = "dps"
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Target Endpoint"
          + "Service_Bundle" = "true"
        }
      + tags_all                                    = {
          + "DMS_Source"     = "dps"
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Target Endpoint"
          + "Service_Bundle" = "true"
        }
      + timestamp_column_name                       = "_timestamp"
      + use_csv_no_sup_value                        = false
      + use_task_start_time_for_full_load_timestamp = false
    }

  # module.setup-dms-endpoints["dps-case-notes"].module.dms_endpoints.aws_iam_policy.dms-operator-s3-policy[0] will be created
  + resource "aws_iam_policy" "dms-operator-s3-policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "dpr-dms-dps-case-notes-operator-s3-target-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "kms:*",
                          + "cloudwatch:*",
                          + "ec2:CreateNetworkInterface",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeVpcs",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:ModifyNetworkInterfaceAttribute",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "s3:*Object*",
                          + "s3:PutObjectTagging",
                          + "s3:GetBucketLocation",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3::*:dpr-*/*",
                          + "arn:aws:s3::*:dpr-*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                          + "s3:ListAllMyBuckets",
                          + "s3:ListAccessPoints",
                          + "s3:ListJobs",
                          + "s3:ListObjects",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.setup-dms-endpoints["dps-case-notes"].module.dms_endpoints.aws_iam_policy.dms-s3-target-policy[0] will be created
  + resource "aws_iam_policy" "dms-s3-target-policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "dpr-dms-dps-case-notes-s3-target-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:*",
                          + "kms:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.setup-dms-endpoints["dps-case-notes"].module.dms_endpoints.aws_iam_role.dms-operator-s3-target-role[0] will be created
  + resource "aws_iam_role" "dms-operator-s3-target-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "dms.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-dms-dps-case-notes-operator-s3-target-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.setup-dms-endpoints["dps-case-notes"].module.dms_endpoints.aws_iam_role.dms-s3-role[0] will be created
  + resource "aws_iam_role" "dms-s3-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "dms.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-dms-dps-case-notes-s3-endpoint-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.setup-dms-endpoints["dps-case-notes"].module.dms_endpoints.aws_iam_role_policy_attachment.dms-operator-s3-attachment[0] will be created
  + resource "aws_iam_role_policy_attachment" "dms-operator-s3-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dpr-dms-dps-case-notes-operator-s3-target-role"
    }

  # module.setup-dms-endpoints["dps-case-notes"].module.dms_endpoints.aws_iam_role_policy_attachment.dms-s3-attachment[0] will be created
  + resource "aws_iam_role_policy_attachment" "dms-s3-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dpr-dms-dps-case-notes-s3-endpoint-role"
    }

Plan: 83 to add, 166 to change, 0 to destroy.

```